# Data Clean and Merge

### Database-style DataFrame Merges

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [6]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
        'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [7]:
df2 = DataFrame({'key': ['a', 'b', 'd'],
        'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [8]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [9]:
pd.merge(df1, df2, on='key', how = 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [10]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})

df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [11]:
df4 = DataFrame({'rkey': ['a', 'b', 'd', 'b'],
                 'data2': range(4)})

df4

  rkey  data2
0    a      0
1    b      1
2    d      2
3    b      3

In [12]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      0    b      3
2    b      1    b      1
3    b      1    b      3
4    b      6    b      1
5    b      6    b      3
6    a      2    a      0
7    a      4    a      0
8    a      5    a      0

In [13]:
pd.merge(df1, df2, how='right')

  key  data1  data2
0   b    0.0      1
1   b    1.0      1
2   b    6.0      1
3   a    2.0      0
4   a    4.0      0
5   a    5.0      0
6   d    NaN      2

In [14]:
df2 = DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                 'data2': range(5)})

df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [15]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [16]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    a      5    0.0
10   a      5    2.0
11   b      6    1.0
12   b      6    3.0

In [17]:
pd.merge(df1, df2, how='outer')

   key  data1  data2
0    b    0.0    1.0
1    b    0.0    3.0
2    b    1.0    1.0
3    b    1.0    3.0
4    b    6.0    1.0
5    b    6.0    3.0
6    a    2.0    0.0
7    a    2.0    2.0
8    a    4.0    0.0
9    a    4.0    2.0
10   a    5.0    0.0
11   a    5.0    2.0
12   c    3.0    NaN
13   d    NaN    4.0

In [18]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'],
        'key2': ['one', 'two', 'one'],
        'lval': [1, 2, 3]})
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [19]:
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
        'key2': ['one', 'one', 'one', 'two'],
        'rval': [4, 5, 6, 7]})
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [20]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [21]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

### Merging on Index

In [22]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                   'value': range(6)})

left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [23]:
right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
right1

   group_val
a        3.5
b        7.0

In [24]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [25]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [26]:
lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                   'key2': [2000, 2001, 2002, 2001, 2002], 
                   'data': np.arange(5.)})
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [27]:
righth = DataFrame(np.arange(12).reshape((6, 2)),
                   index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                          [2001, 2000, 2000, 2000, 2001, 2002]],
                   columns=['event1', 'event2'])
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [28]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [29]:
left2 = DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                  index=['a', 'c', 'e'],
                  columns=['Ohio', 'Nevada'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [30]:
right2 = DataFrame([[7., 8.], [9., 10.], [11., 12.], [13., 14.]],
                   index=['b', 'c', 'd', 'e'],
                   columns=['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [31]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

### 1.3 Join

In [32]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [33]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [34]:
test = pd.merge(left1,right1, left_on='key', how='outer', right_index=True)
test

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [35]:
test.sort_index()

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

### 1.4 Concatenate

In [36]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [37]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [38]:
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([5, 6], index=['f', 'g'])

In [39]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [40]:
pd.concat([s1, s2, s3], axis=1)

/Users/dwang35/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [41]:
s4 = pd.concat([s1 * 5, s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [42]:
s1

a    0
b    1
dtype: int64

In [43]:
pd.concat([s1, s4], axis=1)

/Users/dwang35/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [44]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [45]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

In [46]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [47]:
df1 = DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df1

          a         b         c         d
0  0.963528  0.006783  1.974435  1.608624
1  0.839192  0.740912  1.165575 -1.985182
2  0.786158  0.846627  1.878141  0.737160

In [48]:
df2 = DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
df2

          b         d         a
0 -1.842885  0.677049 -0.277202
1  1.250342  1.321912  0.837206

In [49]:
pd.concat([df1, df2], ignore_index=True)

/Users/dwang35/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  0.963528  0.006783  1.974435  1.608624
1  0.839192  0.740912  1.165575 -1.985182
2  0.786158  0.846627  1.878141  0.737160
3 -0.277202 -1.842885       NaN  0.677049
4  0.837206  1.250342       NaN  1.321912

## Reshaping and Pivoting

### 2.1 Reshaping with Hierarchical Indexing

In [50]:
import numpy as np
data = DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio', 'Colorado'], name='state'),
                 columns=pd.Index(['one', 'two', 'three'], name='number'))

data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [51]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [53]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [54]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [55]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [56]:
s1 = Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = Series([4, 5, 6], index=['c', 'd', 'e'])
s1

a    0
b    1
c    2
d    3
dtype: int64

In [57]:
s2

c    4
d    5
e    6
dtype: int64

In [58]:
pd.concat([s1, s2])

a    0
b    1
c    2
d    3
c    4
d    5
e    6
dtype: int64

In [59]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [60]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [61]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [62]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

## 3. Data Transformation

### 3.1 Removing Duplicates

In [63]:
data = DataFrame({'k1': ['one']*3 + ['two']*4,
                  'k2': [1, 1, 2, 3, 3, 4, 4,]})

data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [64]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [65]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [66]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [67]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [68]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [69]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

### 3.2 Transforming Data Using a Function or Mapping

In [70]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [71]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [72]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [73]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 3.3 Replacing Values

In [74]:
data = Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [75]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [76]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [77]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [78]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 3.4 Discretization and Binning

In [1]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [2]:
bins = [18, 25, 35, 60, 100]

In [3]:
cats = pd.cut(ages, bins)
cats

NameError: name 'pd' is not defined

In [82]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [83]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [84]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

### 3.5 Detecting and Filtering Outliers

In [85]:
np.random.seed(12345)

In [86]:
data = DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [87]:
col = data[3]
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [88]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [89]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

### 3.6 Permutation and Random Sampling

In [4]:
df = DataFrame(np.arange(5 * 4).reshape(5, 4))
sampler = np.random.permutation(5)
sampler

NameError: name 'DataFrame' is not defined

In [91]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [92]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
df.take(np.random.permutation(len(df))[:3])

In [412]:
#bag = np.array([5, 7 ,-1, 6, 4])
sampler1 = np.random.randint(0, 5, size=10)
sampler1

array([0, 0, 4, 3, 1, 1, 4, 2, 4, 4])

In [413]:
draws = df.take(sampler1)
draws

    0   1   2   3
0   0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
4  16  17  18  19
4  16  17  18  19

## Read and Write Dataset

In [416]:
pd.read_csv('AAPL_BS.csv')

,gvkey,datadate,fyearq,fqtr,indfmt,consol,popsrc,datafmt,tic,cusip,...,aqepsq,chq,citotalq,cogsq,dlttq,gdwlamq,intanq,niq,cik,costat
0,1690,20100331,2010,2,INDL,C,D,STD,AAPL,37833100,...,NaN,10018.0,3088.0,7658.0,0.0,NaN,823.0,3074.0,320193,A
1,1690,20100630,2010,3,INDL,C,D,STD,AAPL,37833100,...,NaN,9705.0,3236.0,9291.0,0.0,NaN,1032.0,3253.0,320193,A
2,1690,20100930,2010,4,INDL,C,D,STD,AAPL,37833100,...,NaN,11261.0,4154.0,12502.0,0.0,NaN,1083.0,4308.0,320193,A
3,1690,20101231,2011,1,INDL,C,D,STD,AAPL,37833100,...,NaN,10734.0,6164.0,16087.0,0.0,NaN,1263.0,6004.0,320193,A
4,1690,20110331,2011,2,INDL,C,D,STD,AAPL,37833100,...,NaN,15978.0,5999.0,14015.0,0.0,NaN,1248.0,5987.0,320193,A
5,1690,20110630,2011,3,INDL,C,D,STD,AAPL,37833100,...,NaN,12091.0,7571.0,16168.0,0.0,NaN,1910.0,7308.0,320193,A
6,1690,20110930,2011,4,INDL,C,D,STD,AAPL,37833100,...,NaN,9815.0,6677.0,16347.0,0.0,NaN,4432.0,6623.0,320193,A
7,1690,20111231,2012,1,INDL,C,D,STD,AAPL,37833100,...,NaN,10310.0,13005.0,24909.0,0.0,NaN,4368.0,13064.0,320193,A
8,1690,20120331,2012,2,INDL,C,D,STD,AAPL,37833100,...,NaN,10121.0,11762.0,19882.0,0.0,NaN,4745.0,11622.0,320193,A
9,1690,20120630,2012,3,INDL,C,D,STD,AAPL,37833100,...,NaN,7945.0,8832.0,19194.0,0.0,NaN,5461.0,8824.0,320193,A
10,1690,20120930,2012,4,INDL,C,D,STD,AAPL,37833100,...,NaN,10746.0,8190.0,20584.0,0.0,NaN,5359.0,8223.0,320193,A
11,1690,20121231,2013,1,INDL,C,D,STD,AAPL,37833100,...,NaN,16154.0,13191.0,31864.0,0.0,NaN,5843.0,13078.0,320193,A
12,1690,20130331,2013,2,INDL,C,D,STD,AAPL,37833100,...,NaN,12053.0,9899.0,25562.0,0.0,NaN,5536.0,9547.0,320193,A
13,1690,20130630,2013,3,INDL,C,D,STD,AAPL,37833100,...,NaN,11248.0,5702.0,20605.0,16958.0,NaN,5875.0,6900.0,320193,A
14,1690,20130930,2013,4,INDL,C,D,STD,AAPL,37833100,...,NaN,14259.0,7275.0,21818.0,16960.0,NaN,5756.0,7512.0,320193,A
15,1690,20131231,2014,1,INDL,C,D,STD,AAPL,37833100,...,NaN,14077.0,13237.0,33604.0,16961.0,NaN,6127.0,13072.0,320193,A
16,1690,20140331,2014,2,INDL,C,D,STD,AAPL,37833100,...,NaN,18949.0,10278.0,25812.0,16962.0,NaN,5983.0,10223.0,320193,A
17,1690,20140630,2014,3,INDL,C,D,STD,AAPL,37833100,...,NaN,12977.0,8085.0,20751.0,29030.0,NaN,6141.0,7748.0,320193,A
18,1690,20140930,2014,4,INDL,C,D,STD,AAPL,37833100,...,NaN,13844.0,9463.0,24145.0,28987.0,NaN,8758.0,8467.0,320193,A
19,1690,20141231,2015,1,INDL,C,D,STD,AAPL,37833100,...,NaN,19478.0,18905.0,42283.0,32504.0,NaN,8999.0,18024.0,320193,A
20,1690,20150331,2015,2,INDL,C,D,STD,AAPL,37833100,...,NaN,14489.0,14316.0,31875.0,40072.0,NaN,8772.0,13569.0,320193,A
21,1690,20150630,2015,3,INDL,C,D,STD,AAPL,37833100,...,NaN,15319.0,9065.0,26840.0,47419.0,NaN,8823.0,10677.0,320193,A
22,1690,20150930,2015,4,INDL,C,D,STD,AAPL,37833100,...,NaN,21120.0,9681.0,27834.0,53463.0,NaN,9009.0,11124.0,320193,A
23,1690,20151231,2016,1,INDL,C,D,STD,AAPL,37833100,...,NaN,16689.0,17226.0,42495.0,53204.0,NaN,9126.0,18361.0,320193,A
24,1690,20160331,2016,2,INDL,C,D,STD,AAPL,37833100,...,NaN,21514.0,10948.0,28159.0,69374.0,NaN,9092.0,10516.0,320193,A
25,1690,20160630,2016,3,INDL,C,D,STD,AAPL,37833100,...,NaN,18237.0,8737.0,23726.0,68939.0,NaN,8767.0,7796.0,320193,A
26,1690,20160930,2016,4,INDL,C,D,STD,AAPL,37833100,...,NaN,20484.0,9755.0,26491.0,75427.0,NaN,8620.0,9014.0,320193,A
27,1690,20161231,2017,1,INDL,C,D,STD,AAPL,37833100,...,NaN,16371.0,17502.0,45188.0,73557.0,NaN,8271.0,17891.0,320193,A
28,1690,20170331,2017,2,INDL,C,D,STD,AAPL,37833100,...,NaN,15157.0,10362.0,29973.0,84531.0,NaN,8090.0,11029.0,320193,A
29,1690,20170630,2017,3,INDL,C,D,STD,AAPL,37833100,...,NaN,18571.0,8594.0,25566.0,89864.0,NaN,8105.0,8717.0,320193,A
30,1690,20170930,2017,4,INDL,C,D,STD,AAPL,37833100,...,NaN,20289.0,11109.0,30164.0,97207.0,NaN,8015.0,10714.0,320193,A
31,1690,20171231,2018,1,INDL,C,D,STD,AAPL,37833100,...,NaN,27491.0,19374.0,51636.0,103922.0,NaN,8038.0,20065.0,320193,A
32,1690,20180331,2018,2,INDL,C,D,STD,AAPL,37833100,...,NaN,45059.0,11877.0,34976.0,101362.0,NaN,0.0,13822.0,320193,A
33,1690,20180630,2018,3,INDL,C,D,STD,AAPL,37833100,...,NaN,31971.0,11472.0,30179.0,97128.0,NaN,0.0,11519.0,320193,A

In [417]:
draws.to_csv('out.csv')